app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("title", "description", "due_date", "completed", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"
---
    def create
        @task = Task.new(task_params)
        if @task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["description", "Test description2"], ["updated_at", "2024-08-27 14:00:41.532124"], ["id", 2]]
---
    def update
        @task = Task.find(params[:id])
        if @task.update(task_params)